package javaStudy;

/*
 * 자바의 기본 : 위에 있는 패키지는 나중에 배움
 * 
 * 주의 
 * 
 * 1. 아래의 소스코드에 보라색은 키워드 (예약어 : 단어 자체가 의미를 내포하고 있다)
 * 이 키워드를 변수나 클래스 이름 등으로 사용하면 안됨 
 * 
 * 2. 아래의 public 있어도 없어도 상관 없음
 * 그러니 이건 신경 x
 * 
 * 3. 모든 키워드와 키워드, 클래스 이름 중간에는 반드시 공백이 들어가야 인식함
 * 공백이 없으면, 하나의 단어로 인식함
 * 
 * 4. 클래스 이름 옆에는 반드시 {} 를 사용하고, 앞으로 {}를 클래스 옆에 붙은, 클래스를 정의한
 * 내용이 있는 블락이라고 해서, 이걸 클래스 바디라고 부름
 * 
 * 5.클래스 이름은 반드시 첫자는 대문자로 시작해야함
 * 일주일이 지난 후에도 이걸 지치지 않으면 안됨
 * 
 * 6. 자바 내의 데이터를 제외한 모든 코드에는 한글 사용 금지
 * 
 * 7. 클래스 명에 특문은 숫자 , $,_ 등만 허용됩니다. 단 숫자는 처음에 올 수 없습니다.
 * 
 * 8. 자바는 문법에 매우 업격하기 때문에, 모든 실행, 선언 ,초기화 구문 끝에는 반드시 ; 를 사용해서 구문을 구분지어 줘야함
 * 
 * 9.하나의 자바 소스 파일 내에는 하나 이상의 클래스를 정의 할 수 있습니다. 단, public 키워드는 단 하나의 클래스만 가질 수 있음
 * 한번 이상 사용하면 에러입니다. 또한 이 public 을 가진 클래스가 대표 클래스가 되고, main 메서드를 갖게되며
 * 파일명은 이 클래스 명으로 합니다.
 */



public class SyntaxEx {
	
	public void main(String[] arg)
	{
		
	}
	
}


class TestClass
{
	
}
